gustavowd/FreePMU/STM32F769_EWizard/Src/tarefasPMU.c
/*
 * Arquivo de tarefas de Flavio Lori Grando(2016) em sua PMU proposta com código adaptado ao
 * sistema embarcado STM32F746G
 */

#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>
#include <stdbool.h>
#include <math.h>
#include <string.h>
#include "main.h"
#include "arm_const_structs.h"
#include "cmsis_os.h"
#include "stm32f7xx_hal.h"

#define MCLOCK_FREQ 100000000
#define numero_pontos 256

extern osMessageQId SerialGPSq;

extern TIM_HandleTypeDef 			 htim2;
extern UART_HandleTypeDef 			 huart6;

extern volatile unsigned short adcBuffer[numero_pontos*3];

void UARTGetChar(UART_HandleTypeDef *huart, unsigned char *data, int timeout);

extern void MX_USART6_UART_Init(void);
extern unsigned int Get_ADC_Calib (void);


//				LEITURA DOS DADOS DO GPS

int cnt=0; // contador dos separadores (virgulas)
unsigned int date_limit, tow_limit, wno_limit, size; //delimitadores das informaçoes

char serialGPS_SET = 0;
char dado_gps[70];	//buffer da mensagem
char ID;			//Proprietary message identifier
char UTC_WNO[4]; 	//UTC week number
char UTC_TOW[6];	//UTC Time of Week
unsigned long week_num, sec_of_week, SOC=0;
unsigned long num;





///////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////
//				ESTIMAÇÃO DOS DADOS DE INTERESSE
//
// Fasores trifasicos, frequencia e rocof
unsigned n=0, t_inicial=2;
unsigned int send_serial=0;
unsigned int i=1;
int j=0;
volatile unsigned int n_amostras=256;

unsigned int k=0;
unsigned int flag=0;
unsigned int r,s,t, rr, ss, tt;

//Tabela da DFT
float teta, seno[numero_pontos], cosseno[numero_pontos];
//aplicacao do fator de calibracao
float FC;
float FasesAC[numero_pontos*3];
float FasesAC_mod_R[numero_pontos], FasesAC_mod_S[numero_pontos], FasesAC_mod_T[numero_pontos];
float FasesAC_ReIm_R[numero_pontos*2], FasesAC_ReIm_S[numero_pontos*2], FasesAC_ReIm_T[numero_pontos*2];
//Aplicacao da DFT
float modulor,modulos,modulot,faser,fases,faset,somaMr,somaMs,somaMt,somaFr,somaFs,somaFt;
//Fasor em coordenadas retangulares
float Mr,Ms,Mt,Fr,Fs,Ft;
//Fasor em coordenadas polares
float Mag_R,Mag_S,Mag_T,Fase_R,Fase_S,Fase_T;
//Frequencia e rocof
float f0=60; // Freq nominal
int fps=30; //Fasor por segundo - metade da freq. nominal neste trabalho
float desvio_faseR, desvio_faseS, desvio_faseT, freq_R, freq_S, freq_T, Freq, ROCOF;
float Fase_R_ant, Fase_S_ant, Fase_T_ant, Freq_ant;
float desvio_ang_esp;
float tolerancia = 10;
//media movel do desvio de angulo
float vetor_desvioR[10], vetor_desvioS[10], vetor_desvioT[10];
float soma_r, soma_s, soma_t;
unsigned int d=0;
//Correçao da taxa de amostragem
float  dif, vetor_freq[10], media_freq, soma_freq, media_freq_2;
float vetor_rocof[10], media_rocof, soma_rocof;
unsigned int  f=0, g=0, contador = 0;
//Transmissao via serial
float buffer[9];

//Definicoes para correcao das medidas
float mag, faseR_x_mag, faseS_x_mag, faseT_x_mag, faseR_x_freq, faseS_x_freq, faseT_x_freq;
float MagR_x_mag, MagS_x_mag, MagT_x_mag, MagR_x_freq;

//Fasores finais
float Mag_R_final,Mag_S_final,Mag_T_final,Fase_R_final,Fase_S_final,Fase_T_final;
float Freq_final;

//Outros
float x, y, z, w, a=0;
unsigned int Freq_int;

//////////////////////////////////////////
//           PARA SER CONFIGURADO  !!!!!!!!
// Faction of Second
unsigned long FracSec = 0x00000000;  // 40 000 us
// Time base
unsigned long Time_base = 0x000F4240;   // 1 000 000 us

///////////////////////////////////////////

union {
	float pf;
	unsigned char byte[4];
}convert_float_to_char;


// Referencia uma estrutura para o semáforo que sincroniza a transmissão pela porta serial
osSemaphoreId  pmuSem_id;
extern osSemaphoreId syncSem_id;
extern volatile unsigned char data_flag;
extern char isSyncCreated;
//extern char *IP_global[16];

void MX_ADC1_Init(void);
void MX_ADC2_Init(void);
void MX_ADC3_Init(void);

extern ADC_HandleTypeDef hadc1;
extern ADC_HandleTypeDef hadc2;
extern ADC_HandleTypeDef hadc3;

void PMU_Task(void const * argument)
{
	/////////////////////// DEFINIÇÕES INICIAIS

	//while(1){
	//	vTaskDelay(1000);
	//}

	  osSemaphoreDef(SEM2);
	  pmuSem_id = osSemaphoreCreate(osSemaphore(SEM2), 1);
	  //osSemaphoreWait(pmuSem_id, osWaitForever);

	  MX_ADC1_Init();
	  MX_ADC2_Init();
	  MX_ADC3_Init();

	  HAL_ADC_Start(&hadc3);
	  HAL_ADC_Start(&hadc2);
	  HAL_ADCEx_MultiModeStart_DMA(&hadc1, (uint32_t*)adcBuffer, 768);


	// Tabela da DFT
	teta=2*M_PI/n_amostras;

	for(k=0;k<n_amostras;k++){
		seno[k]=sin(k*teta);
		cosseno[k]=cos(k*teta);
	}

	//Carrega valores iniciais
	desvio_ang_esp = 0;  //desvio de ângulo esperado
	tolerancia = 6.5;    //tolerancia do desvio esperado
	Freq_ant = f0;

	//Calcula a fração de segundo (para etiqueta de tempo)
	if(f0 == 60){
		FracSec = 0x00008235;  //Fração de segundo 0,03333
	}else if(f0 == 50){
		FracSec = 0x00009C40;  // Fração de segundo = 0,04
	}

	// carrega vetores de media móvel
	for(i=0;i<10;i++){
		vetor_freq[i]=f0;
		vetor_rocof[i]=0;
	}


	//////////////////// INICIO DO PROCESSO DE ESTIMACAO
	while(1)
	{


		// Espera completar as 768 amostras
		osSemaphoreWait(pmuSem_id, osWaitForever);
		//osDelay(33);

//#if 1
		// Calcula o fator de calibração
		FC=1.21/(Get_ADC_Calib());

		// Aplica o fator de calibracao e carrega novo vetor (liberando o buffer)
		for(j=0;j<(n_amostras*3);j++){
		    FasesAC[j]=adcBuffer[j]*FC;//(3.0/4096);
		}

		send_serial = 0;


		r=0;
		s=1;
		t=2;

		somaMr=0;
		somaMs=0;
		somaMt=0;

		somaFr=0;
		somaFs=0;
		somaFt=0;


		//Aplicacao da DFT
		int k2 = 0;
		for (k=0;k<n_amostras;k++){

			modulor = FasesAC[r]*cosseno[k];
			modulos = FasesAC[s]*cosseno[k];
			modulot = FasesAC[t]*cosseno[k];

			//##############################
			// Para FFT
			FasesAC_ReIm_R[k2]=FasesAC[r];
			FasesAC_ReIm_S[k2]=FasesAC[s];
			FasesAC_ReIm_T[k2]=FasesAC[t];
			FasesAC_ReIm_R[k2+1]=0;
			FasesAC_ReIm_S[k2+1]=0;
			FasesAC_ReIm_T[k2+1]=0;

			k2 += 2;
			//##############################

			faser = FasesAC[r]*seno[k];
			fases = FasesAC[s]*seno[k];
			faset = FasesAC[t]*seno[k];

			somaMr += modulor;
			somaMs += modulos;
			somaMt += modulot;

			somaFr += faser;
			somaFs += fases;
			somaFt += faset;

			r +=3;
			s +=3;
			t +=3;
		}

		//##############################
		// Para FFT
		arm_cfft_f32(&arm_cfft_sR_f32_len256,FasesAC_ReIm_R,0,1);
		arm_cmplx_mag_f32(FasesAC_ReIm_R,FasesAC_mod_R,256);

