gustavowd/FreePMU/STM32F769_EWizard/Src/tarefasPMU.c
		arm_cfft_f32(&arm_cfft_sR_f32_len256,FasesAC_ReIm_S,0,1);
		arm_cmplx_mag_f32(FasesAC_ReIm_S,FasesAC_mod_S,256);

		arm_cfft_f32(&arm_cfft_sR_f32_len256,FasesAC_ReIm_T,0,1);
		arm_cmplx_mag_f32(FasesAC_ReIm_T,FasesAC_mod_T,256);
		//##############################


		//Fasor em coordenadas retangulares
		Mr=somaMr*2/n_amostras;
		Ms=somaMs*2/n_amostras;
		Mt=somaMt*2/n_amostras;

		Fr=somaFr*2/n_amostras;
		Fs=somaFs*2/n_amostras;
		Ft=somaFt*2/n_amostras;

		//Fasor em coordenadas polares
		Mag_R = (sqrt((Mr*Mr)+(Fr*Fr)))/sqrt(2);
		Mag_S = (sqrt((Ms*Ms)+(Fs*Fs)))/sqrt(2);
		Mag_T = (sqrt((Mt*Mt)+(Ft*Ft)))/sqrt(2);

		Fase_R = (atan2(-Fr,Mr)*180/M_PI);
		Fase_S = (atan2(-Fs,Ms)*180/M_PI);
		Fase_T = (atan2(-Ft,Mt)*180/M_PI);

		//Desvio de fase (para estimacao de frequencia)
		desvio_faseR = (Fase_R-Fase_R_ant);
		desvio_faseS = (Fase_S-Fase_S_ant);
		desvio_faseT = (Fase_T-Fase_T_ant);


		Fase_R_ant = Fase_R;
		Fase_S_ant = Fase_S;
		Fase_T_ant = Fase_T;



		// Correção do phase shift
		//Desabilitar essa correção para os testes de frequência em estado estacionário!!
/*
		if(desvio_faseR > (desvio_ang_esp+tolerancia)){
			desvio_faseR = desvio_ang_esp;
		}
		if(desvio_faseR < (desvio_ang_esp-tolerancia)){
			desvio_faseR = desvio_ang_esp;
		}

		if(desvio_faseS > (desvio_ang_esp+tolerancia)){
			desvio_faseS = desvio_ang_esp;
		}
		if(desvio_faseS < (desvio_ang_esp-tolerancia)){
			desvio_faseS = desvio_ang_esp;
		}

		if(desvio_faseT > (desvio_ang_esp+tolerancia)){
			desvio_faseT = desvio_ang_esp;
		}
		if(desvio_faseT < (desvio_ang_esp-tolerancia)){
			desvio_faseT = desvio_ang_esp;
		}
*/


		// Correcao da regiao de 180 graus para o desvio de fase
		if(desvio_faseR>270){
			desvio_faseR = desvio_faseR-360;
		}
		if(desvio_faseR<-270){
			desvio_faseR = desvio_faseR+360;
		}
		if(desvio_faseS>270){
			desvio_faseS = desvio_faseS-360;
		}
		if(desvio_faseS<-270){
			desvio_faseS = desvio_faseS+360;
		}
		if(desvio_faseT>270){
			desvio_faseT = desvio_faseT-360;
		}
		if(desvio_faseT<-270){
			desvio_faseT = desvio_faseT+360;
		}





		//FREQUENCIA E ROCOF FINAL (sem correcoes)
		//Calculo da freq para 30 pulsos e 3 fases

		freq_R = f0 + (desvio_faseR*fps)/360.0;
		freq_S = f0 + (desvio_faseS*fps)/360.0;
		freq_T = f0 + (desvio_faseT*fps)/360.0;



		Freq = (freq_R+freq_S+freq_T)/3.0;
		Freq = 60;


		if(f0 == 50){
			if(Freq > 55){
				Freq = 55;
			}else if(Freq < 45){
				Freq = 45;
			}
		}else if(f0 == 60){
			if(Freq > 65){
				Freq = 65;
			}else if(Freq < 55){
				Freq = 55;
			}
		}



		media_freq_2 = (Freq + Freq_ant)/2.0;

		//Desvio de ângulo esperado (para correção do phase shift)
		desvio_ang_esp = 360*(Freq-f0)/fps;


		ROCOF = (Freq - Freq_ant)*fps;

		Freq_ant = Freq;

		//media movel no valor final do rocof
		n=3;
		vetor_rocof[g] = ROCOF;
		g++;
		for(i=0;i<n;i++){
		    soma_rocof = soma_rocof + vetor_rocof[i];
		    media_rocof = soma_rocof/n;
		}
		soma_rocof = 0;
		if(g==n){
		    g=0;
		}


		// Media movel no valor final da frequencia
		vetor_freq[f] = Freq;
		f++;
		for(i=0;i<2;i++){
		    soma_freq = soma_freq + vetor_freq[i];
		    media_freq = soma_freq/2.0;
		}
		soma_freq = 0;
		if(f==2){
		    f=0;
		}

		Freq_final = media_freq; //+media_rocof/fps;






		// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! TESTES SEM SINAL
		media_freq = f0;  /////////////////// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
		//!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

/*		if(a<25){
			TIM8->ARR = (float)180000000/((50)*n_amostras);
			a++;
		}

*/

#if 1
		//AJUSTE DA TAXA DE AMOSTRAGEM


		htim2.Instance->ARR = (float)MCLOCK_FREQ/((media_freq)*n_amostras);

		//APLICAÇÃO DAS CORREÇÕES (em magnitude e fase)

		//MAGNITUDE- ajuste da magnitude
		// Y-data = Magnitude reference - X-data = Magnitude measured (não em p.u.)


		mag = Mag_R;
		MagR_x_mag = (float)-0.0018945693 + (float)4.1062603119*mag;
		MagR_x_mag += (float)-0.0077128570*mag*mag;
		MagR_x_mag += (float)0.0262579711*mag*mag*mag;
		MagR_x_mag += (float)-0.0142115525*mag*mag*mag*mag;

		mag = Mag_S;
		MagS_x_mag = (float)-0.0018945693+(float)4.1062603119*mag;
		MagS_x_mag += (float)-0.0077128570*mag*mag;
		MagS_x_mag += (float)0.0262579711*mag*mag*mag;
		MagS_x_mag += (float)-0.0142115525*mag*mag*mag*mag;

		mag = Mag_T;
		MagT_x_mag = (float)-0.0018945693+(float)4.1062603119*mag;
		MagT_x_mag += (float)-0.0077128570*mag*mag;
		MagT_x_mag += (float)0.0262579711*mag*mag*mag;
		MagT_x_mag += (float)-0.0142115525*mag*mag*mag*mag;


		//FASE
		//correcao de fase em funcao da magnitude
		// Y-data = Phase deviation - X-data = Magnitude measured (não em p.u.)

		mag = MagR_x_mag;
		faseR_x_mag = (float)-1.2595979549+(float)0.4039280602*mag;
		faseR_x_mag += (float)-0.1010751752*mag*mag;
		faseR_x_mag += (float)0.0096132710*mag*mag*mag;

		mag = MagS_x_mag;
		faseS_x_mag = (float)-1.2595979549+(float)0.4039280602*mag;
		faseS_x_mag += (float)-0.1010751752*mag*mag;
		faseS_x_mag += (float)0.0096132710*mag*mag*mag;

		mag = MagT_x_mag;
		faseT_x_mag = (float)-1.2595979549+(float)0.4039280602*mag;
		faseT_x_mag += (float)-0.1010751752*mag*mag;
		faseT_x_mag += (float)0.0096132710*mag*mag*mag;

		// FREQUENCIA
		//correcao de fase em funcao da frequencia
		mag = media_freq;
		faseR_x_freq = (float)0.0237760101*mag-(float)1.1727874302;
		faseS_x_freq = (float)0.0237760101*mag-(float)1.1727874302;
		faseT_x_freq = (float)0.0237760101*mag-(float)1.1727874302;



		MagR_x_freq = mag*((float)-3.6463158287E-5)+(float)0.0011139213;
		MagR_x_freq = mag*((float)-3.6463158287E-5)+(float)0.0011139213;
		MagR_x_freq = mag*((float)-3.6463158287E-5)+(float)0.0011139213;


		// Calcula magnitude final
		// Ajustes da magnitude:
/*
		// Sensor AZUL:
		Mag_R_final = MagR_x_mag * 60.665;
		Mag_S_final = MagS_x_mag * 61.065;
		Mag_T_final = MagT_x_mag * 61.095;
*/
		// Sensor PRETO:
		Mag_R_final = MagR_x_mag * 64.727;
		Mag_S_final = MagS_x_mag * 65.105;
		Mag_T_final = MagT_x_mag * 64.596;


		//Calcula fase final (aplica as correcoes anteriores)
		Fase_R_final = Fase_R+faseR_x_mag+faseR_x_freq;
		Fase_S_final = Fase_S+faseS_x_mag+faseS_x_freq;
		Fase_T_final = Fase_T+faseT_x_mag+faseT_x_freq;


		// Correcao da regiao de 180 graus para a fase final
		if(Fase_R_final > 180.0){
			Fase_R_final = (Fase_R_final-360);
		}
		if(Fase_R_final <= -180.0){
			Fase_R_final = (Fase_R_final+360);
		}
		if(Fase_S_final>180.0){
			Fase_S_final = (Fase_S_final-360);
		}
		if(Fase_S_final<= -180.0){
			Fase_S_final = (Fase_S_final+360);
		}
		if(Fase_T_final>180.0){
			Fase_T_final = (Fase_T_final-360);
		}
		if(Fase_T_final<= -180.0){
			Fase_T_final = (Fase_T_final+360);
		}


