gustavowd/FreePMU/STM32F769_EWizard/Src/tarefasPMU.c
/*
		 Mag_R_final = 125;
		 Mag_S_final = 125;
		 Mag_T_final = 125;
		 Fase_R_final = 120;
		 Fase_S_final = 240;
		 Fase_T_final = 0;



		// DADOS DA TRANSMISSAO (via serial pro PC)
		buffer[0] = SOC;
		buffer[1] = Mag_R_final;//_final;
		buffer[2] = Mag_S_final;
		buffer[3] = Mag_T_final;
		buffer[4] = Fase_R_final;
		buffer[5] = Fase_S_final;
		buffer[6] = Fase_T_final;
		buffer[7] = Freq_final;
		buffer[8] = media_rocof;*/

/*      // Envia os dados pela serial
		char *dados = (char*)&buffer;
		UARTPutMultiChar(dados);
*/

		SOC = 1468976006;
		FracSec = (unsigned long)a*FracSec;
		a=a+1;
		if(a==fps){
			SOC = SOC+1;
			a=0;
		}
		#endif


		if((isSyncCreated == 1) && (data_flag)){
			//cnt++;
			//if(cnt > 50){
				cnt = 0;

				osSemaphoreRelease(syncSem_id);

			//}

		}

	}
}

////////////////////////////////////////////////////////
///////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
//			Pilha de protocolos
//
#if 0
 #include "lwiplib.h"

extern void SocketTCPClient( void *pvParameters );
extern void pmu_tcp_server(void *pvParameters);
extern void pmu_tcp_server_out(void *pvParameters);
#endif
void UpLwIP(void *param)
{
#if 0
	(void)param;

	//UARTPutString(USART1, "Ethernet lwIP example\n\r");
    //
    // Tell the user what we are doing just now.
    //
    // UARTPutString(USART1, "Aguardando IP.\n\r");

    //
    // Initialize the lwIP library, using DHCP.
    //
    lwIPInit(IPADDR_USE_DHCP);

    // Espera pela comunicação estar ativa
    while(lwip_link_up != TRUE)
    {
    	DelayTask(10);
    	/* Loop forever. LW_Periodic_Tasks() must be called in order to check
    	 * if there is a packet to be read. There is no interrupt handler for
    	 * the ENC28J60 in such driver implementation. Need for DHCP to work. */
    	LW_Periodic_Tasks();
    }

	//sys_thread_new("LwIP TCP client", SocketTCPClient, NULL, 1280, 5);
    sys_thread_new("PMU TCP Server", pmu_tcp_server, NULL, 2048, 6);
    sys_thread_new("PMU TCP Server out", pmu_tcp_server_out, NULL, 2048, 5);

    while(1)
    {
    	DelayTask(10);
    	/* Loop forever. LW_Periodic_Tasks() must be called in order to check
    	 * if there is a packet to be read. There is no interrupt handler for
    	 * the ENC28J60 in such driver implementation */
    	LW_Periodic_Tasks();
    }
#endif
}



////////////////////////////////////////////////////////
///////////////////////////////////////////////////////
//////////////////////////////////////////////////////////


extern xSemaphoreHandle sUART;
char teste;

void GPS_Task(void const * argument)
{

	osMessageQDef(SerialGPSq, 128, unsigned char);
	SerialGPSq = osMessageCreate(osMessageQ(SerialGPSq), NULL);


	sUART = xSemaphoreCreateBinary();
	MX_USART6_UART_Init();
	HAL_UART_Receive_IT(&huart6, (uint8_t*)&teste, 1);

	while(1){
	    volatile unsigned char *p;

		p = (unsigned char*)&dado_gps;

		do{
			UARTGetChar(&huart6, (uint8_t*)p, osWaitForever);
		  }while(*p != '$');

		p--;

		do{
		   p++;
		   UARTGetChar(&huart6, (uint8_t*)p, osWaitForever);
		}while(*p != '\n');




		//Extrai a informaçao: segundos na semana
		for(i=0;i<6;i++){

		  UTC_TOW[i]=dado_gps[25+i];

		}

		//Extrai a informaçao: numero da semana
		for(i=0;i<4;i++){

			UTC_WNO[i]=dado_gps[35+i];

		}

		//Envia pro LabVIEW
		//char *dados = (char *)&dado_gps;
		//UARTPutMultiChar(dados);

		//Datasheet mentiroso, não é fonte UTC, é GPS! 10 anos de diferença
		week_num = atoi(UTC_WNO);

		sec_of_week = atoi(UTC_TOW);

		//segundo secular UNIX time (1 jan 1970)
		SOC = sec_of_week + week_num*604800 + 60*60*24*365*10 + 60*60*24*7;

		//SOC = 1468976006;
		a=0; //Pra zerar o contador do FracSec
		}

}

void UARTGetChar(UART_HandleTypeDef *huart, unsigned char *data, int timeout)
{
	osEvent event;

	if (huart->Instance == USART6)
	{
		event = osMessageGet(SerialGPSq, timeout);
		if(event.status == osEventMessage){
			*data = (unsigned char)event.value.v;
		}
	}

}


/*
	    		size = sizeof(dado_gps);

	    		//Identificação dos separadores (virgulas)
	    		cnt = 0;

	    		for(j=0;j<size;j++){

	    			if(dado_gps[j] == ','){
	    				cnt++;
	    			}

	    			switch (cnt){
	    			case 4:
	    				date_limit = j;
	    				break;
	    			case 5:
	    				tow_limit = j;
	    				break;
	    			case 6:
	    				wno_limit = j;
	    				break;
	    			default:
	    				break;
	    			}
	    		}

	    		//Extrai a informaçao: segundos na semana
	    		size = tow_limit - date_limit - 4; //Ex: ...,113851.00,...

	    		for(j=0;j<size;j++){
	    			UTC_TOW[j]=dado_gps[date_limit+1+j];
	    		}

	    		//Extrai a informaçao: numero da semana
	    		size = wno_limit - tow_limit-1;	//Ex: ,1196,
	    		for(j=0;j<size;j++){
	    			UTC_WNO[i]=dado_gps[tow_limit+1+j];
	    		}

	    		x = dado_gps[0];
	    		y = dado_gps[70];

	    		week_num = atoi(UTC_WNO);  //string para inteiro - numero da semana
	    		sec_of_week = atoi(UTC_TOW); //string para inteiro - segundos na semana
*/






//////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
//						FORMATAÇÃO DOS DADOS
//

// IEEE Std C37.118.2 - 2011 - PMU Standard data transfer

// SYNC[1] Second byte
// bit[7] = Reserved
// bits[6,5,4] = Frame Type, bits[3,2,1,0]

#define A_SYNC_AA 0xAA
#define A_SYNC_DATA 0x01
#define A_SYNC_HDR 0x11
#define A_SYNC_CFG1 0x21
#define A_SYNC_CFG2 0x31
#define A_SYNC_CFG3 0x52
#define A_SYNC_CMD 0x41

// IMPLEMENTAÇÃO DO CRC-CCITT
// Baseado na norma

uint16_t CRC_CCITT;

uint16_t ComputeCRC(unsigned char *Message, unsigned char MessLen)
{
	uint16_t crc=0xFFFF;
	uint16_t temp;
	uint16_t quick;
	int i;

	for(i=0;i<MessLen;i++)
	{
		temp = (crc>>8) ^ Message[i];
		crc <<= 8;
		quick = temp ^ (temp >> 4);
		crc ^= quick;
		quick <<=5;
		crc ^= quick;
		quick <<= 7;
		crc ^= quick;
	}
	return crc;
}


unsigned char ucData[128];


unsigned int PmuID = 0x0001;			// Identificacao da PMU





/////////////// FRAME DE DADOS
int frame_data(void)
{

	// 1. SYNC = Data Message Sync Byte and Frame Type
	ucData[0] = A_SYNC_AA;
	ucData[1] = A_SYNC_DATA;

	// 2. FRAMESIZE = Tamanho do frame, incluindo CHK
	ucData[2] = (unsigned char)0x00;
	ucData[3] = (unsigned char)0x32;

	// 3. IDCODE = ID da fonte de transmissao
	ucData[4] = (unsigned char)((PmuID & 0xFF00) >> 8);
	ucData[5] = (unsigned char)(PmuID & 0x00FF);

	// 4. SOC = Second Of Century = Estampa de tempo, segundo secular
	ucData[6] = (unsigned char)((SOC & 0xFF000000) >> 24);
	ucData[7] = (unsigned char)((SOC & 0x00FF0000) >> 16);
	ucData[8] = (unsigned char)((SOC & 0x0000FF00) >> 8);
	ucData[9] = (unsigned char)(SOC & 0x000000FF);

	// 5. FRACSEC = Fração do segundo e qualidade do tempo
	ucData[10] = (unsigned char)((FracSec & 0xFF000000) >> 24);  //Time quality (seção 6.2.2)
	ucData[11] = (unsigned char)((FracSec & 0x00FF0000) >> 16);  //fracsec
	ucData[12] = (unsigned char)((FracSec & 0x0000FF00) >> 8);   //fracsec
	ucData[13] = (unsigned char)(FracSec & 0x000000FF);			//fracsec

	// 6. STAT = Flags, a criterio do usuario
	ucData[14] = 0x00;
	ucData[15] = 0x00;

	int i = 16;

