gustavowd/FreePMU/STM32F769_EWizard/Src/tarefasPMU.c
///////////////// FRAME DE CABEÇALHO
int frame_header(void)
{

	//unsigned char ucData[20];

	// 1. SYNC = Data Message Sync Byte andFrame Type
	ucData[0] = A_SYNC_AA;
	ucData[1] = A_SYNC_HDR;

	// 2. FRAMESIZE = Tamanho do frame, incluindo CHK
	ucData[2] = (unsigned char)0x00;
	ucData[3] = (unsigned char)0x15; // 21 em decimal

	// 3. IDCODE = ID da fonte de transmissao
	ucData[4] = (unsigned char)((PmuID & 0xFF00) >> 8);
	ucData[5] = (unsigned char)(PmuID & 0x00FF);

	// 4. SOC = Second Of Century = Estampa de tempo, segundo secular
	ucData[6] = (unsigned char)((SOC & 0xFF000000) >> 24);
	ucData[7] = (unsigned char)((SOC & 0x00FF0000) >> 16);
	ucData[8] = (unsigned char)((SOC & 0x0000FF00) >> 8);
	ucData[9] = (unsigned char)(SOC & 0x000000FF);

	// 5. FRACSEC = Fração do segundo e qualidade do tempo
	ucData[10] = (unsigned char)((FracSec & 0xFF000000) >> 24);  //Time quality (seção 6.2.2)
	ucData[11] = (unsigned char)((FracSec & 0x00FF0000) >> 16);  //fracsec
	ucData[12] = (unsigned char)((FracSec & 0x0000FF00) >> 8);   //fracsec
	ucData[13] = (unsigned char)(FracSec & 0x000000FF);			//fracsec

	// 6. DATA = qualquer coisa
	ucData[14] = (unsigned char)(1);
	ucData[15] = (unsigned char)(2);
	ucData[16] = (unsigned char)(3);
	ucData[17] = (unsigned char)(4);

	//21. CRC-CCITT = Calcula o CRC

	CRC_CCITT = ComputeCRC(ucData, 19);

	ucData[18] = (unsigned char)((CRC_CCITT & 0xFF00) >> 8);
	ucData[19] = (unsigned char)(CRC_CCITT & 0x00FF);

	return 19+1;
}


/* Include core modules */
//#include "stm32f4xx.h"
/* Include my libraries here */
//#include "defines.h"
#include "string.h"
//#include "tm_stm32f4_delay.h"
//#include "tm_stm32f4_disco.h"
//#include "tm_stm32f4_emwin.h"
/* GUI modules */
//#include "button.h"
//#include "DIALOG.h"
//#include "stimer.h"
//#include "GRAPH.h"
/*********************************************************************
*
*       Defines
*
**********************************************************************
*/
#define MAX_VALUE 200


/*********************************************************************
*
*       Static data
*
**********************************************************************
*/
//static GRAPH_DATA_Handle  _ahData[3]; // Array of handles for the GRAPH_DATA objects
//static GRAPH_SCALE_Handle _hScaleV;   // Handle of vertical scale
//static GRAPH_SCALE_Handle _hScaleH;   // Handle of horizontal scale

//static I16 _aValue[3];

//static GUI_COLOR _aColor[] = {GUI_RED, GUI_GREEN, GUI_LIGHTBLUE}; // Array of colors for the GRAPH_DATA objects

/*********************************************************************
*
*       Static code
*
**********************************************************************
*/
/*********************************************************************
*
*       _AddValues
*
* Function description
*   This routine calculates new random values in dependence of the previous added values
*   and adds them to the GRAPH_DATA objects
*/
#if 0
static void _AddValues(void) {
  unsigned i;
  GUI_POINT valor;
  for (i = 0; i < GUI_COUNTOF(_aColor); i++) {
    int Add = ((unsigned)rand()) % (2 + i * i);
    int Vz  = (((unsigned)(rand()) % 2) << 1) - 1;
    _aValue[i] += Add * Vz;
    if (_aValue[i] > MAX_VALUE) {
      _aValue[i] = MAX_VALUE;
    } else if (_aValue[i] < 0) {
      _aValue[i] = 0;
    }
    //valor.x = j;
    valor.y = _aValue[i]+30;
    GRAPH_DATA_YT_AddValue(_ahData[i], _aValue[i]+30);
  }
}

BRTOS_TIMER TouchTimer;
BRTOS_TIMER GraphTimer;

TIMER_CNT UpdateTouch(void)
{
	TM_EMWIN_UpdateTouch();
	return 50;
}

TIMER_CNT UpdateGraph(void)
{
	_AddValues();
	GUI_X_SignalEvent();
	return 5;
}


#include "stdbool.h"

/* Graph handle */
GRAPH_Handle hGraph;
GRAPH_DATA_Handle hData;
GRAPH_DATA_Handle hData2;
GRAPH_DATA_Handle hData3;
GRAPH_SCALE_Handle yScale;
GRAPH_SCALE_Handle xScale;
TEXT_Handle text;

void EmWinTask(void *param)
{

	BUTTON_Handle hButton, hB1, hB2, hB3, hB4;
	PROGBAR_Handle hProgbar;
	GRAPH_Handle graph1;
	uint8_t i;
	WM_HWIN hDlg;
	WM_HWIN hGraph;
	bool continuar = false;

	hGraph = 0;

	/* Initialize LEDs */
	TM_DISCO_LedInit();

	/* Initialize emWin */
	if (TM_EMWIN_Init() != TM_EMWIN_Result_Ok) {
		/* Initialization error */
		while (1) {
			/* Toggle RED led */
			TM_DISCO_LedToggle(LED_RED);

			/* Delay */
			DelayTask(100);
		}
	}
	LCD_SetVSize(320, 240);
	LCD_SetVSizeEx(0, 320, 240);

	OSTimerInit(1024,3);
	OSTimerSet(&TouchTimer,UpdateTouch,50);

	GUI_ClearRect(0, 0, 320, 240);

	/*
	   Enable memory for EMWIN
	   This features allows you to update screen very fast without flickering, because EMWIN draws on LCD layer 1 (LTDC)
	   but layer 2 (LTDC) is shown on LCD. After all drawings from EMWIN are done, layer 1 is copied to layer 2
	   and everything is shown to user at same time, without flickering.
	   You have to use @ref TM_EMWIN_Exec() to execute all EMWIN pending tasks in future or memory does not have effect here
	*/
	TM_EMWIN_MemoryEnable();

	WM_SetDesktopColor(GUI_BLACK);
	#if GUI_SUPPORT_MEMDEV
	WM_SetCreateFlags(WM_CF_MEMDEV);
	#endif

	// Mostra o cursor do mouse
	GUI_CURSOR_Show();

	/* Create graph through all LCD screen */
	hGraph = GRAPH_CreateEx(0, 0, 320, 240, 0, WM_CF_SHOW, 0, GUI_ID_GRAPH0);

	/* Set grids and border */
	GRAPH_SetGridVis(hGraph, 1);
    GRAPH_SetBorder(hGraph, 25, 5, 5, 15);
	GRAPH_SetColor(hGraph, 0x00202020, GRAPH_CI_GRID);

	/* Create scale for graph */
	yScale = GRAPH_SCALE_Create(3, GUI_TA_LEFT, GRAPH_SCALE_CF_VERTICAL, 25);
	GRAPH_SCALE_SetOff(yScale, 100);
	GRAPH_SCALE_SetTextColor(yScale, GUI_BLUE);
	/* Attach it to graph */
	GRAPH_AttachScale(hGraph, yScale);

	xScale = GRAPH_SCALE_Create(230, GUI_TA_HCENTER, GUI_TA_HCENTER, 50);
	GRAPH_SCALE_SetTextColor(xScale, GUI_BLUE);
	GRAPH_SCALE_SetFactor(xScale, 4);
	/* Attach it to graph */
	GRAPH_AttachScale(hGraph, xScale);

	text = TEXT_Create(290, 225, 30, 15, GUI_ID_TEXT0, WM_CF_SHOW, "500us",GUI_TA_LEFT | GUI_TA_TOP);
	TEXT_SetFont(text, &GUI_Font13_ASCII);
	TEXT_SetTextColor(text,GUI_RED);
	TM_EMWIN_Exec();

    // Add graphs
    //
    for (i = 0; i < GUI_COUNTOF(_aColor); i++) {
      _aValue[i] = rand() % 180;
      _ahData[i] = GRAPH_DATA_YT_Create(_aColor[i], 290, 0, 0);
      GRAPH_DATA_YT_SetAlign(_ahData[i], GRAPH_ALIGN_LEFT);
      GRAPH_AttachData(hGraph, _ahData[i]);
    }

	/* Create button with GUI_ID_OK ID number */
    hButton = BUTTON_Create(240, 5, 80, 40, GUI_ID_BUTTON0, WM_CF_SHOW);
    hB1 = BUTTON_Create(240, 50, 80, 40, GUI_ID_BUTTON1, WM_CF_SHOW);
    hB2 = BUTTON_Create(240, 95, 80, 40, GUI_ID_BUTTON2, WM_CF_SHOW);
    hB3 = BUTTON_Create(240, 140, 80, 40, GUI_ID_BUTTON3, WM_CF_SHOW);
    hB4 = BUTTON_Create(240, 185, 80, 40, GUI_ID_BUTTON4, WM_CF_SHOW);
    //hB4 = BUTTON_CreateEx(240, 195, 80, 40, WM_HBKWIN, WM_CF_SHOW, 0, GUI_ID_BUTTON4);
    BUTTON_SetFont(hButton, &GUI_Font13HB_ASCII);
    BUTTON_SetFont(hB1, &GUI_Font13HB_ASCII);
    BUTTON_SetFont(hB2, &GUI_Font13HB_ASCII);
    BUTTON_SetFont(hB3, &GUI_Font13HB_ASCII);
    BUTTON_SetFont(hB4, &GUI_Font13HB_ASCII);
    BUTTON_SetText(hButton, "Continue...");
    BUTTON_SetText(hB1, "Green\n\rON");
    BUTTON_SetText(hB2, "Green\n\rOFF");
    BUTTON_SetText(hB3, "Red\n\rON");
    BUTTON_SetText(hB4, "Red\n\rOFF");
    GRAPH_SetBorder(hGraph, 25, 5, 90, 15);
    BUTTON_SetTextAlign(hB1,GUI_TA_HCENTER | GUI_TA_VCENTER);
    BUTTON_SetTextAlign(hB2,GUI_TA_HCENTER | GUI_TA_VCENTER);
    BUTTON_SetTextAlign(hB3,GUI_TA_HCENTER | GUI_TA_VCENTER);
    BUTTON_SetTextAlign(hB4,GUI_TA_HCENTER | GUI_TA_VCENTER);

    TM_EMWIN_Exec();


	while (!continuar) {
		/* Wait till button pressed */
		GUI_X_WaitEvent();
		TM_EMWIN_Exec();

		/* Get pressed key */
		/* Check if button was pressed */
		switch (GUI_GetKey()) {
			case GUI_ID_BUTTON0:
				continuar = true;
				break;
			case GUI_ID_BUTTON1:
				/* Led On */
				TM_DISCO_LedOn(LED_GREEN);
				break;
			case GUI_ID_BUTTON2:
				/* Led Off */
				TM_DISCO_LedOff(LED_GREEN);
				break;
			case GUI_ID_BUTTON3:
				/* Led On */
				TM_DISCO_LedOn(LED_RED);
				break;
			case GUI_ID_BUTTON4:
				/* Led Off */
				TM_DISCO_LedOff(LED_RED);
				break;
		}
	}

    BUTTON_Delete(hButton);
    BUTTON_Delete(hB1);
    BUTTON_Delete(hB2);
    BUTTON_Delete(hB3);
    BUTTON_Delete(hB4);
    GRAPH_SetBorder(hGraph, 25, 5, 5, 15);
    TM_EMWIN_Exec();


    OSTimerSet(&GraphTimer,UpdateGraph,5);

	/* Wait till button pressed */
	while (1) {
		/* Get pressed key */
		GUI_X_WaitEvent();
		TM_EMWIN_Exec();

		/* Check if button was pressed */
		if (GUI_GetKey() == GUI_ID_BUTTON0) {
			/* Led Off */
			TM_DISCO_LedOff(LED_GREEN);

			/* Stop while loop */
			//break;
		}
	}

}
#endif

